  [
    {
      "id": 1,
      "titre": "Introduction",
      "subChapters": [
        {
          "titre": "Contexte",
          "subSubChapters": [
            {
              "URL": "assets/data/img/scene.png",
              "description": "Dans le cadre de l'UV AC20 (UV d'acquisition de connaissances scientifiques), j'ai entrepris une étude approfondie de l'art numérique dans ses différentes formes. Mon objectif était de mieux comprendre cet art émergeant et d'appréhender les méthodes utilisées pour sa création. <br>Au cours de cette étude, j'ai également eu l'opportunité d'apprendre de nouveaux langages de programmation tels que le TypeScript, le JavaScript, le CSS et le HTML. Ces langages m'ont permis de créer un rapport qui reflète certains aspects de cet art, sous la forme d'un site internet immersif. À travers ce site, je souhaite vous offrir une expérience immersive et interactive pour découvrir l'art numérique dans toute sa diversité.",
              "type": "text-short"
            }
          ]
        },{
          "titre": "Présentation du sujet",
          "subSubChapters": [
            {
              "URL": "chemin/vers/image2.jpg",
              "description": "Le sujet central de mon étude porte sur l'art numérique, une forme d'expression artistique qui émerge avec les avancées technologiques. Cependant, une question fondamentale se pose : le code est-il l'avenir de l'art ? Cette interrogation soulève des débats et des réflexions quant à l'impact du numérique sur l'art traditionnel, ainsi que sur les avantages et les limites de l'utilisation du code dans la création artistique. À travers mon rapport, j'explorerai différentes formes d'art numérique telles que l'art vectoriel, l'art interactif, l'art génératif, le crypto art et les NFT, le pixel art, la sculpture digitale, ainsi que la création de sites internet artistiques.",
              "type": "text-short"
            }
          ]
        }
      ]
    },
    {
      "id": 2,
      "titre": "Différentes formes d'art numérique",
      "subChapters": [
        {
          "titre": "Art vectoriel",
          "subSubChapters": [
            {
              "description": "L'art vectoriel est une forme de création artistique qui utilise des logiciels de dessin vectoriel pour produire des images basées sur des vecteurs. Contrairement aux images bitmap, les illustrations vectorielles sont composées de courbes, de lignes et de formes géométriques définies par des équations mathématiques, ce qui leur permet d'être redimensionnées et modifiées sans perdre leur netteté ou leur qualité.",
              "type": "text-short"

            },{
              "description":"Les logiciels de dessin vectoriel populaires tels qu'Adobe Illustrator, CorelDRAW et Inkscape offrent des outils puissants pour créer des illustrations vectorielles. Quelques exemples courants d'art vectoriel incluent des logos d'entreprises, des dessins animés, des motifs de textiles, des illustrations de livres, des infographies, des conceptions d'emballages, des icônes d'applications et des enseignes. Les artistes vectoriels explorent souvent un large éventail de styles, du minimalisme et de l'abstraction aux illustrations détaillées et aux dessins réalistes. Grâce à sa polyvalence et à sa capacité à produire des images nettes et claires, l'art vectoriel continue de jouer un rôle important dans le monde du design et de l'art numérique.",
              "type": "text-short"

            },{
              "description":"Les avantages de l'art vectoriel sont sa flexibilité et sa résolution indépendante. Étant donné que les images vectorielles sont constituées d'objets géométriques, elles peuvent être redimensionnées à n'importe quelle taille sans perte de qualité, ce qui les rend polyvalentes pour diverses applications. De plus, les illustrations vectorielles peuvent être modifiées, recolorées et éditées de manière non destructive, offrant ainsi une grande liberté créative." ,
              "type": "text-short"
            },{
              "URL": "assets/data/img/aVectoriel_femme_violon.jpg",
              "description":"Portrait du soudan – Kathryn Rathke ",
              "type": "img"
            },{
              "URL": "assets/data/img/aVectoriel_escaliers_oranges_roses.jpg",
              "description":"All talked out - Yordanka Poleganova  ",
              "type": "img"
            },{
              "URL": "assets/data/img/aVectoriel_femme_blonde.jpg",
              "description":"Icône pour la marque laitière - Albert Morell ",
              "type": "img"
            }
          ]
        },
        {
          "titre": "Art interactif",
          "subSubChapters": [
            {
              "description":"L'art interactif est une forme d'expression artistique qui engage activement le spectateur et lui permet de participer ou d'interagir avec l'œuvre d'art elle-même. Contrairement aux médias traditionnels tels que la peinture ou la sculpture statique, l'art interactif implique souvent l'utilisation de technologies numériques et de capteurs pour créer des expériences immersives et engageantes." ,
              "type": "text-short"
            },{
              "description":"Les artistes interactifs utilisent une variété de supports et de techniques pour créer leurs œuvres. Cela peut inclure des installations interactives, des projets de réalité virtuelle ou augmentée, des jeux vidéo artistiques, des performances participatives et bien d'autres formes encore. Ces œuvres d'art encouragent le spectateur à devenir un participant actif, à explorer l'espace, à interagir avec les éléments de l'œuvre ou à influencer son comportement." ,
              "type": "text-short"
            },{
              "description":"Les technologies modernes, telles que les capteurs de mouvement, les écrans tactiles, les dispositifs de réalité virtuelle ou les interfaces utilisateur avancées, permettent aux artistes de créer des expériences interactives riches et variées. Les spectateurs peuvent interagir avec les œuvres en touchant, en manipulant des objets virtuels, en déclenchant des sons ou des effets visuels, en répondant à des stimuli environnementaux ou en participant à des dialogues virtuels." ,
              "type": "text-short"
            },{
              "description": "L'art interactif est souvent multidisciplinaire, combinant des éléments de l'art visuel, de la technologie, de la programmation et de l'interaction humaine. Il peut aborder une grande variété de sujets et de thèmes, tels que la politique, la culture, l'environnement, l'identité ou les questions sociales. Les artistes interactifs explorent également de nouvelles façons de raconter des histoires, de provoquer des émotions et d'engager le public d'une manière immersive et participative.",
              "type": "text-short"
            },{
              "description":"Quelques exemples d'art interactif comprennent des installations interactives qui réagissent aux mouvements du spectateur, des expériences de réalité virtuelle où l'utilisateur peut explorer des mondes virtuels, des jeux d'art qui défient les attentes et les normes traditionnelles, des performances interactives où le public est invité à participer et à influencer le déroulement de l'œuvre, et des projets numériques collaboratifs qui permettent aux personnes du monde entier de créer ensemble." ,
              "type": "text-short"
            },{
              "URL": "assets/data/img/aInteractif_colore.jpg",
              "description":"Exposition Au-delà des limites par le teamLab, La Villette  ",
              "type": "img"
            },{
              "URL": "assets/data/img/aInteractif_nuage.jpg",
              "description":"Installation interactive Résonance, Studio Tish ",
              "type": "img"
            }
          ]
        },
        {
          "titre": "Art génératif",
          "subSubChapters": [
            {
              "description":"L'art génératif est une forme d'expression artistique qui repose sur l'utilisation de systèmes informatiques ou d'algorithmes pour créer des œuvres d'art autonomes et évolutives. Contrairement à d'autres formes d'art où l'artiste crée manuellement chaque détail, l'art génératif se concentre sur la création de règles et de paramètres qui permettent à l'œuvre de se générer elle-même, souvent de manière aléatoire ou en réponse à des entrées externes." ,
              "type": "text-short"
            },{
              "description":"Les artistes génératifs utilisent des logiciels, des langages de programmation et des techniques de codage pour créer des systèmes qui génèrent des compositions visuelles, des sculptures, de la musique, des poèmes et bien d'autres formes d'art. Ces systèmes peuvent être basés sur des algorithmes mathématiques, des réseaux neuronaux, des automates cellulaires ou d'autres modèles computationnels." ,
              "type": "text-short"
            },{
              "description":"L'art génératif offre des possibilités infinies de création, car les œuvres peuvent être générées à l'infini avec des variations subtiles ou drastiques à chaque itération. Les artistes génératifs peuvent définir des règles précises pour contrôler les formes, les couleurs, les textures, les motifs ou les mouvements, ou bien laisser une plus grande place à l'imprévisibilité et à l'émergence de l'inattendu." ,
              "type": "text-short"
            },{
              "description": "Les œuvres d'art génératif sont souvent caractérisées par leur nature dynamique, évolutive et interactive. Quelques exemples d'art génératif comprennent des installations lumineuses qui se modifient en fonction des mouvements du public, des compositions musicales générées par des algorithmes complexes, des paysages visuels en constante évolution basés sur des règles mathématiques, des sculptures générées par ordinateur imprimées en 3D et des peintures numériques générées à partir d'ensembles de données.",
              "type": "text-short"
            },{
              "description":"Les avancées en matière d'intelligence artificielle ont ouvert de nouvelles perspectives et possibilités. Les artistes peuvent désormais exploiter les capacités des systèmes d'intelligence artificielle pour enrichir leurs créations. Les algorithmes d'apprentissage automatique et de réseaux neuronaux peuvent être utilisés pour générer des modèles, des textures ou des formes artistiques uniques. Ces modèles peuvent être entraînés sur de vastes ensembles de données artistiques existantes, leur permettant d'apprendre les motifs et les styles spécifiques pour créer de nouvelles œuvres originales. L'intelligence artificielle offre également la possibilité d'interagir avec les spectateurs et de créer des expériences personnalisées en analysant et en adaptant les réponses de l'utilisateur. L'utilisation de l'intelligence artificielle dans l'art génératif ouvre de nouvelles perspectives créatives et élargit les frontières de l'expression artistique en explorant l'intersection entre l'imagination humaine et les capacités computationnelles.",
              "type": "text-short"
            },{
              "URL": "assets/data/img/aGene_plantes.jpg",
              "description":"Fifty sisters - Jon McCormack",
              "type": "img"
            },{
              "URL": "assets/data/img/aGene_son.jpg",
              "description":"Noise drawing - Jon McCormack",
              "type": "img"
            },{
              "description":"Jon McCormack est un artiste et chercheur spécialisé dans l'art génératif, la musique et l'intelligence artificielle. Il explore les possibilités de créer des formes de vie artificielles en s'inspirant de la complexité de la nature. Ses œuvres ont été exposées dans des galeries et musées renommés à travers le monde, et il a remporté de nombreux prix dans les domaines de l'art médiatique et de la recherche informatique. Il est également un universitaire respecté, avec ses travaux publiés dans des revues scientifiques de premier plan. En tant que fondateur et directeur de SensiLab, il dirige des recherches transdisciplinaires sur les technologies créatives à l'université Monash en Australie. Son parcours et ses réalisations témoignent de son influence dans le domaine de l'art numérique et de son expertise en informatique." ,
              "type": "text-short"
            },{
              "URL": "assets/data/img/JonMcCormack.jpg",
              "description":"",
              "type": "img"
            },{
              "description": "J’ai eu l'opportunité d'engager une discussion avec lui, voici la retranscription de notre échange : <br><br> <span> Enora <span/> : Quels outils et technologies utilisez-vous ?<br>Jon McCormak : “Largely my own software (written in C/C++, Python or Java). I use Processing for sketches and Cinema4D for 3D work.” <br> J’utilise principalement mon propre logiciel, écrit en C/C++, Python ou Java. J'utilise Processing pour mes esquisses (sketches) et Cinema4D pour mon travail en 3D.<br>Enora : Dans quelle mesure les mathématiques, la science ou la technologie influencent-elles votre art génératif ?<br>Jon McCormak : “ Science tries to explain how the world is, so I'm influenced by scientific thought about the world and our place in it (e.g. evolution) from a philosophical perspective (you can read a book like Dennett's \"Darwins dangerous idea\" as an example). I studied maths at university and its a great tool for clarifying your thinking. I also find a lot from other disciplines so I wouldn't say science & technology are my only influences at all .” <br> La science essaie d'expliquer comment le monde est, donc je suis influencé(e) par la pensée scientifique sur le monde et notre place dedans (par exemple, l'évolution) d'un point de vue philosophique (vous pouvez lire un livre comme \"Darwin's Dangerous Idea\" de Dennett comme exemple). J'ai étudié les mathématiques à l'université et c'est un excellent outil pour clarifier sa pensée. Je trouve également beaucoup d'inspiration dans d'autres disciplines, donc je ne dirais pas que la science et la technologie sont mes seules influences.<br>Enora : Comment incorporez-vous des éléments de hasard ou de chance dans votre art ?<br>Jon McCormak : “This is a simple question with a very complex answer! It comes down to what \"randomness\" really means. I certainly use randomness in the software I write, but its usually very specific and it doesn't mean the results are random at all :-)” <br> C'est une question simple avec une réponse très complexe! Tout dépend de ce que l'on entend par \"aléatoire\". J'utilise des éléments de hasard dans les logiciels que j'écris, mais c'est généralement très spécifique et cela ne signifie pas du tout que les résultats sont réellement aléatoires :-).<br>Enora : En quoi votre art se distingue-t-il de l'art traditionnel ou de l'art numérique non-génératif ?<br>Jon McCormak : “Generative art is about making a process so in many ways its closely connected to conceptual art, except that the process is usually enacted and realises something.” <br> L'art génératif consiste à créer un processus, et à bien des égards, il est étroitement lié à l'art conceptuel, à la différence que le processus est généralement mis en œuvre et réalise quelque chose.<br>Enora : Quels sont les défis ou obstacles auxquels vous êtes confronté(e) ?<br>Jon McCormak : “Time mainly!” – Le temps principalement.",
              "type": "text-short"
            }
          ]
        },
        {
          "titre": "Crypto art et NFT",
          "subSubChapters": [
            {
              "description":"Le crypto art et les NFT (Non-Fungible Tokens) représentent une révolution dans le monde de l'art numérique en introduisant des concepts uniques de propriété, de rareté et de traçabilité grâce à la technologie de la blockchain. Une blockchain est une technologie de stockage et de transmission d'informations de manière décentralisée et sécurisée. Elle repose sur un réseau de participants (ou nœuds) qui vérifient et enregistrent les transactions dans des blocs de données, formant ainsi une chaîne de blocs. Le crypto art fait référence à des œuvres d'art numériques créées et échangées en utilisant des cryptomonnaies comme le Bitcoin ou l'Ethereum. Les NFT sont des jetons numériques uniques qui représentent la propriété ou la provenance d'un actif numérique spécifique, tel qu'une œuvre d'art, un fichier multimédia ou un objet virtuel.",
              "type": "text-short"
            },{
              "description":"Les artistes crypto utilisent des logiciels de création numérique pour produire des œuvres d'art uniques ou en édition limitée, qu'ils ensuite associent à des NFT. Chaque NFT est enregistré sur une blockchain, ce qui garantit l'authenticité, la propriété et l'unicité de l'œuvre. Grâce à la nature immuable de la blockchain, les informations sur la provenance et les transactions associées à une œuvre d'art sont enregistrées de manière transparente, ce qui permet une traçabilité sans précédent.",
              "type": "text-short"
            },{
              "description":"L'un des aspects les plus intéressants du crypto art et des NFT est la possibilité pour les artistes de percevoir des redevances sur les ventes secondaires de leurs œuvres. Chaque fois qu'un NFT est vendu à un nouveau propriétaire, l'artiste peut être automatiquement rémunéré par un pourcentage du prix de vente, ce qui leur permet de bénéficier des éventuelles plus-values de leurs œuvres à mesure qu'elles se revendent sur le marché.",
              "type": "text-short"
            },{
              "description":"Les NFT ont également créé de nouvelles opportunités pour les collectionneurs d'art numérique. Les amateurs peuvent acheter des NFT pour posséder des œuvres d'art exclusives, les afficher numériquement dans des galeries virtuelles ou les revendre sur des plateformes spécialisées. ",
              "type": "text-short"
            },{
              "description":"Le crypto art et les NFT ont suscité un engouement croissant dans le domaine de l'art numérique, avec des ventes record et une communauté d'artistes et de collectionneurs en expansion constante. Cependant, leur émergence a également soulevé des questions sur la durabilité environnementale due à la consommation énergétique élevée des blockchains et sur les problèmes de droits d'auteur et de propriété intellectuelle.",
              "type": "text-short"
            },{
              "URL": "assets/data/img/crypto.jpg",
              "description":"Everydays: the first 5000 days - Beeple",
              "type": "img"
            }
          ]
        },
        {
          "titre": "Pixel art",
          "subSubChapters": [
            {
              "description":"Le pixel art est une forme d'art numérique qui trouve ses origines dans les premiers jeux vidéo et graphismes informatiques. Il se caractérise par l'utilisation de pixels individuels comme éléments de base pour créer des images et des animations.",
              "type": "text-short"
            },{
              "description":"Le pixel art est créé en manipulant et en plaçant des pixels de manière précise, souvent à la main, pour former des motifs, des personnages et des décors. Il tire parti de la nature graphique des écrans, où chaque pixel représente un point d'information visuelle.",
              "type": "text-short"
            },{
              "description":"L'une des principales caractéristiques du pixel art est sa résolution basse ou limitée, typiquement inférieure à celle des images haute définition d'aujourd'hui. Cette esthétique rétro est souvent associée à une nostalgie pour les jeux vidéo classiques des années 80 et 90, mais le pixel art continue également d'être utilisé comme forme d'expression artistique contemporaine.",
              "type": "text-short"
            },{
              "description":"Les artistes pixel art utilisent des logiciels spécifiques ou des éditeurs d'images pour créer leurs œuvres. Ils peuvent utiliser une palette de couleurs limitée, des outils de zoom pour travailler à l'échelle pixel par pixel et des techniques telles que le mélange de couleurs pour créer des effets de dégradé ou de texture.",
              "type": "text-short"
            },{
              "description":"Le pixel art peut prendre de nombreuses formes, notamment des illustrations statiques, des environnements de jeux vidéo, des logos, des icônes et des personnages. Il est également utilisé dans des animations, des cinématiques ou des visuels pour des jeux indépendants, des applications mobiles et d'autres projets numériques.",
              "type": "text-short"
            },{
              "description":"Le charme du pixel art réside dans sa simplicité et sa capacité à transmettre des émotions et des formes reconnaissables malgré les limites de résolution. Les artistes pixel art doivent faire preuve de créativité pour exploiter les contraintes de cette forme d'art et créer des compositions esthétiques et expressives.",
              "type": "text-short"
            },{
              "description":"Le pixel art a connu une résurgence dans la culture populaire et est apprécié par les amateurs de jeux vidéo rétro, ainsi que par les artistes et les designers à la recherche d'un style unique et distinctif. Il incarne une fusion entre l'art, la technologie et la nostalgie, et continue d'évoluer en tant que forme d'expression artistique dynamique et diversifiée.",
              "type": "text-short"
            },{
              "URL": "assets/data/img/aPixel_marseille.jpg",
              "description":"Marseille – eboy ",
              "type": "img"
            },{
              "URL": "assets/data/img/aPixel_sol_gens_nus.jpg",
              "description":"Point – Ced Veray",
              "type": "img"
            }
          ]
        },{
          "titre": "Sculpture digitale",
          "subSubChapters": [
            {
              "description":"La sculpture digitale, également connue sous le nom de sculpture numérique, est une forme d'expression artistique qui utilise des logiciels et des outils numériques pour créer des sculptures en trois dimensions. Contrairement à la sculpture traditionnelle qui implique la manipulation de matériaux physiques tels que l'argile, la pierre ou le métal, la sculpture digitale se déroule entièrement dans un environnement virtuel.",
              "type": "text-short"
            },{
              "description":"Les artistes de sculpture digitale utilisent des logiciels spécialisés de modélisation et de sculpture 3D pour créer des formes tridimensionnelles en manipulant des maillages de points, de courbes ou de polygones. Ces logiciels offrent des fonctionnalités avancées, telles que le modelage, la sculpture, le texturage, l'animation et l'éclairage, permettant aux artistes de donner vie à leurs créations de manière réaliste ou stylisée.",
              "type": "text-short"
            },{
              "description":"La sculpture digitale offre une grande liberté artistique. Les artistes peuvent créer des sculptures réalistes, des formes abstraites, des personnages fantastiques, des créatures imaginaires ou des structures architecturales, sans être limités par les contraintes physiques des matériaux traditionnels. Ils peuvent expérimenter avec différentes textures, couleurs, échelles et formes, tout en bénéficiant de la facilité de modification et de manipulation offerte par le monde numérique.",
              "type": "text-short"
            },{
              "description":"Une caractéristique distinctive de la sculpture digitale est sa nature non matérielle. Les sculptures créées numériquement existent sous forme de fichiers 3D qui peuvent être visualisés sur des écrans d'ordinateur, des projecteurs ou même dans des environnements de réalité virtuelle. Elles peuvent également être utilisées pour la création de sculptures physiques en utilisant des techniques d'impression 3D.",
              "type": "text-short"
            },{
              "description":"La sculpture digitale permet également une collaboration facile entre les artistes et les autres professionnels de l'industrie créative, tels que les animateurs, les concepteurs de jeux vidéo ou les cinéastes. Les sculptures 3D numériques peuvent être intégrées dans des projets multimédias, des films d'animation, des jeux vidéo, des publicités ou des visualisations architecturales.",
              "type": "text-short"
            },{
              "description":"Bien que la sculpture digitale ait ses propres avantages et possibilités, elle ne remplace pas complètement la sculpture traditionnelle. Les deux formes d'expression artistique peuvent coexister et se compléter mutuellement, chacune apportant ses propres qualités et perspectives uniques.",
              "type": "text-short"
            },{
              "description":"La sculpture digitale ouvre de nouvelles voies pour l'exploration artistique et la création de formes tridimensionnelles innovantes. Grâce à l'évolution constante des technologies numériques, la sculpture digitale continue de se développer et de repousser les limites de la créativité, offrant aux artistes un nouveau moyen passionnant d'exprimer leur vision artistique.",
              "type": "text-short"
            },{
              "URL": "assets/data/img/scudig_flora.jpg",
              "description":"Florescence ornata 2 - Nervous System ",
              "type": "img"
            },{
              "URL": "assets/data/img/scudig_chevalier.jpg",
              "description":"Extra-Natural - Miguel Chevalier",
              "type": "img"
            }
          ]
        },{
          "titre": "Sites internet",
          "subSubChapters": [
            {
              "description": "De nos jours, de nombreux artistes et designers utilisent le web pour créer des expériences artistiques uniques et engageantes. Le site internet peut être utilisé comme un support pour exprimer une vision artistique, transmettre un message, ou susciter des émotions chez les spectateurs.",
              "type": "text-short"
            },{
              "description": "L'art sur le web peut prendre de nombreuses formes : des compositions visuelles innovantes, des animations interactives, des expériences sonores immersives, des installations en ligne, et bien plus encore. Les artistes utilisent des langages de programmation tels que HTML, CSS, JavaScript, TypeScript, et des frameworks comme Angular, pour créer des sites web qui combinent esthétique, interactivité et narrativité.",
              "type": "text-short"
            },{
              "description": "La nature interactive du web offre également de nouvelles possibilités pour l'expression artistique. Les visiteurs peuvent interagir avec le site, explorer différentes sections, cliquer sur des éléments interactifs, et ainsi participer activement à l'expérience artistique. Cela permet aux artistes de créer des œuvres d'art qui transcendent les limites des médias traditionnels et qui engagent le spectateur de manière plus immersive.",
              "type": "text-short"
            },{
              "description": "Il convient de noter que la perception d'un site internet en tant qu'œuvre d'art peut varier selon les individus et les contextes. Certains peuvent considérer un site internet comme une forme d'art contemporain, tandis que d'autres peuvent le voir davantage comme un outil de communication ou de marketing. Cependant, de nombreux artistes et institutions d'art reconnaissent le potentiel créatif du web et considèrent les sites internet artistiques comme des œuvres à part entière.",
              "type": "text-short"
            },{
              "description": "En fin de compte, la question de savoir si un site internet est une œuvre d'art dépend de la conception artistique, de l'intention de l'artiste et de la réception par le public. Le web offre une plateforme dynamique et accessible pour la création artistique, permettant de repousser les limites de l'art traditionnel et d'explorer de nouvelles formes d'expression.",
              "type": "text-short"
            },{
              "URL": "assets/data/img/site.png",
              "description":"Hello Enjoy",
              "type": "img"
            }
          ]
        },{
          "titre": "Conclusion",
          "subSubChapters": [
            {
              "description": "Maintenant que nous avons découvert différentes formes d’art, que nous avons étudiés leurs particularités respectives, revenons à la problématique de ce rapport : Le code est-il l’avenir de l’art ?",
              "type": "text-short"
            },{
              "description": "La relation entre le code informatique et l'art est complexe et fascinante. Le code, en tant que langage informatique, est utilisé de multiples façons pour créer, modifier et présenter des œuvres d'art. La programmation devient ainsi un outil puissant pour les artistes, leur permettant d'explorer de nouvelles formes d'expression et de repousser les limites traditionnelles de l'art.",
              "type": "text-short"
            },{
              "description": "Une façon dont le code est utilisé dans la création artistique est à travers la génération d'art algorithmique. Les artistes utilisent des algorithmes pour créer des œuvres visuelles ou sonores, en définissant des règles et des paramètres que l'ordinateur suit pour générer des formes, des motifs et des compositions uniques. Cette approche permet aux artistes de collaborer avec l'intelligence artificielle pour créer des œuvres qui ne seraient pas possibles autrement.",
              "type": "text-short"
            },{
              "description": "Le code est également utilisé pour modifier des œuvres existantes. Les artistes numériques peuvent manipuler des images, des vidéos ou des sons à l'aide de logiciels de traitement numérique, en utilisant des algorithmes et des scripts pour appliquer des effets spéciaux, des filtres ou des transformations. Cela ouvre de nouvelles possibilités pour les artistes traditionnels qui peuvent intégrer des éléments numériques dans leurs œuvres, créant ainsi des expériences multimédias interactives et immersives.",
              "type": "text-short"
            },{
              "description": "L'impact du numérique sur l'art traditionnel est un sujet qui suscite des débats. D'un côté, certains voient le numérique comme une menace pour l'authenticité de l'art, arguant que la facilité avec laquelle les œuvres peuvent être copiées et modifiées numériquement affaiblit leur valeur artistique. D'un autre côté, le numérique offre de nouvelles opportunités d'accessibilité et de diffusion de l'art. Les artistes peuvent partager leurs œuvres en ligne, atteignant un public mondial sans les contraintes géographiques des galeries et des musées traditionnels.",
              "type": "text-short"
            },{
              "description":"L'utilisation du code dans la création artistique présente des avantages et des limites. L'un des avantages majeurs est la possibilité de créer des œuvres génératives qui évoluent avec le temps ou en interaction avec le public. Les artistes peuvent programmer des algorithmes qui répondent aux actions des spectateurs, créant ainsi des expériences uniques et personnalisées. Cependant, cela soulève également des questions éthiques et philosophiques sur le rôle de l'artiste dans le processus créatif. Jusqu'à quel point le rôle de l'artiste est-il réduit lorsque le code prend en charge une partie de la création ?",
              "type": "text-short"
            },{
              "description": "En fin de compte, la relation entre le code et l'art est une exploration continue. Le code informatique offre de nouvelles perspectives aux artistes et redéfinit les frontières de l'art. Alors que nous continuons à évoluer dans un monde numérique, il est essentiel de réfléchir aux implications éthiques, philosophiques et esthétiques de cette relation complexe, en encourageant un dialogue ouvert et en explorant de nouvelles voies pour l'expression artistique.",
              "type": "text-short"
            },{
              "description": "Dans le but d'approfondir ma compréhension de l'art génératif, j'ai entrepris d'apprendre à utiliser P5.js, une bibliothèque spécifiquement conçue pour l'art génératif, qui est basée sur le langage JavaScript. Cette démarche est démontrée dans la suite de mon rapport.",
              "type": "text-short"
            }
          ]
        }
      ]
    },{
      "id": 3,
      "titre": "Génération d'art avec P5.js",
      "subChapters": [
        {
          "titre": "Présentation de P5.js",
          "subSubChapters": [
            {
              "URL": "assets/data/img/p5js.png",
              "type": "img"
            },{
              "description":"P5.js est une bibliothèque de traitement créatif et de programmation graphique en JavaScript, conçue pour faciliter la création d'art numérique et d'animations interactives pour le web. Elle est basée sur la bibliothèque Processing (environnement de développement open-source spécialement conçu pour la création d'art et de design interactifs), largement utilisée dans le domaine de la création artistique et du design graphique. P5.js permet aux artistes, designers, programmeurs et étudiants en informatique d'exprimer leur créativité en utilisant des fonctionnalités de dessin, de manipulation d'images, de vidéos et de sons. " ,
              "type": "text-short"
            },{
              "description":"En utilisant P5.js, les artistes peuvent créer des œuvres d'art interactives qui répondent à l'interaction de l'utilisateur, en utilisant des événements de souris, de clavier et de toucher. P5.js est également une excellente plateforme pour apprendre les bases de la programmation en JavaScript.",
              "type": "text-short"
            },{
              "description":"P5.js est open source et gratuit, ce qui signifie que n'importe qui peut l'utiliser, le modifier et le partager en toute liberté. En raison de sa popularité croissante, la communauté P5.js est en constante expansion, il y a donc de plus en plus de ressources, de tutoriels et de projets à découvrir et à expérimenter.",
              "type": "text-short"
            }
          ]
        }, {
          "titre": "Description de l'apprentissage",
          "subSubChapters": [
            {
              "description":"Comme P5.js est une bibliothèque très complète, il peut être difficile de savoir par où commencer pour l'apprendre. Pour cette raison, j'ai décidé de suivre des tutoriels qui expliquent étape par étape comment générer de l'art avec P5.js.",
              "type": "text-short"
            },{
              "URL": "assets/data/img/sketch.png",
              "description":"Voici à quoi ressemble l’éditeur avant de commencer à coder quoi que ce soit.",
              "type": "text-short"
            },{
              "URL": "assets/data/img/sketch.png",
              "description":"Au début de mon apprentissage, j'ai commencé par comprendre l'utilisation des fonctions setup() et draw() dans P5.js. La fonction setup() est exécutée une seule fois, au lancement du programme, lorsque nous appuyons sur le bouton \"play\" en haut à gauche. En revanche, la fonction draw() est exécutée en boucle tant que le programme est en cours d'exécution, jusqu'à ce que nous l'arrêtions en appuyant sur le bouton carré en haut à gauche. C'est grâce à cette fonction que nous pouvons créer des animations.",
              "type": "text-img-r"
            },{
              "description":"La fonction createCanvas() nous permet de créer un \"canvas\" (une toile) avec les dimensions de notre choix. Elle prend donc deux arguments, la largeur et la hauteur du canvas en pixels. Cette fonction est généralement utilisée à l'intérieur de la fonction setup().",
              "type": "text-short"
            },{
              "description":"Ces trois fonctions (setup(), draw() et createCanvas()) sont couramment utilisées dans la plupart des sketches (un sketch étant un fichier JavaScript sur P5.js). Cependant, la bibliothèque propose de nombreuses autres fonctions, telles que des fonctions de couleur, de forme, d'événements ou encore de texte.",
              "type": "text-short"
            },{
              "description": "Pour explorer ces différentes catégories de fonctions, j'ai consulté la documentation de la bibliothèque et j'ai essayé de comprendre le fonctionnement de chaque fonction. Cela n'a pas été facile, car certaines de ces fonctions étaient assez complexes. Je n'ai pas pu me permettre de m'attarder sur chacune d'entre elles, car je m’étais également fixé comme objectif d'apprendre à utiliser un logiciel de dessin vectoriel et de créer un site web.",
              "type": "text-short"
            }
          ]
        },
        {
          "titre": "Conclusion",
          "subSubChapters": [
            {
              "description": "En fouillant dans la documentation et testant plusieurs fonctions, j’ai découvert la richesse de cette bibliothèque. Avec son large éventail de fonctions, P5.js offre de nombreuses possibilités pour les artistes qui souhaitent s'exprimer à travers le code.",
              "type": "text-short"
            },{
              "description": "L'un des avantages majeurs de P5.js est sa facilité d'utilisation, même pour ceux qui n'ont jamais écrit une seule ligne de code. Grâce à sa syntaxe accessible et à sa documentation complète, il est relativement simple de prendre en main la bibliothèque et de commencer à créer des visuels dès le départ. Même avec peu de connaissances en programmation, il est possible de produire des résultats visuellement captivants.",
              "type": "text-short"
            },{
              "description": "Un autre avantage de P5.js est sa capacité à générer des visuels de manière efficace avec un minimum de code. Grâce à sa riche collection de fonctions, il est possible de réaliser des effets visuels complexes en utilisant relativement peu de lignes de code. Cela permet aux artistes de se concentrer davantage sur la créativité et l'expression artistique, plutôt que de se perdre dans des détails techniques complexes.",
              "type": "text-short"
            },{
              "description": "En utilisant P5.js, les artistes peuvent facilement manipuler des formes géométriques, des couleurs, des images, et des animations pour créer des œuvres d'art numérique interactives et immersives. La bibliothèque offre également une intégration fluide avec les interactions utilisateur, ce qui permet de créer des expériences artistiques engageantes et participatives.",
              "type": "text-short"
            },{
              "description": "En résumé, P5.js se distingue par sa richesse de fonctionnalités et sa facilité d'utilisation, ce qui en fait un outil puissant pour les artistes qui souhaitent explorer le potentiel de l'art numérique. Que vous soyez un débutant ou un artiste expérimenté, P5.js offre une plateforme accessible et flexible pour donner vie à vos idées artistiques et créer des œuvres visuellement saisissantes.",
              "type": "text-short"
            }, {
              "URL": "https://editor.p5js.org/enobnl/full/ENzjIc2DX",
              "type": "sketch"
            },{
              "URL": "https://editor.p5js.org/enobnl/full/xuUEyiG57",
              "type": "sketch"
            },{
              "URL": "https://editor.p5js.org/enobnl/full/uh47Sej85",
              "type": "sketch"
            }
          ]

        }
      ]
    },
    {
      "id": 4,
      "titre": "Art vectoriel avec Inkscape",
      "subChapters": [
        {
          "titre": "Présentation Inkscape",
          "subSubChapters": [
            {
              "description": "Inkscape est un logiciel libre et gratuit de dessin vectoriel, utilisé pour créer des graphismes vectoriels, des illustrations, ou encore des logos. Il permet donc de dessiner des images de haute qualité, qui peuvent être redimensionnés à n'importe quelle taille sans perdre de qualité. <br>Inkscape propose de nombreuses fonctionnalités, notamment la possibilité de dessiner des formes, de modifier les couleurs, les traits et les remplissages, ainsi que la possibilité d'importer et d'exporter des fichiers de différents formats : svg, png, jpg…<br>",
              "type": "text-short"
            },{
              "URL": "assets/data/img/inkscape.png",
              "type": "img"
            }
          ]
        },{
          "titre": "Descritpion de l'apprentissage",
          "subSubChapters": [
            {
              "description": "Pour approfondir ma compréhension de la création artistique basée sur l'art vectoriel, j'ai décidé d'explorer les fonctionnalités clés d'Inkscape en me basant sur des tutoriels vidéo. ",
              "type": "text-short"
            },{
              "description": "Pendant mon apprentissage d'Inkscape, j'ai exploré différentes fonctionnalités de ce logiciel. J'ai utilisé l'outil pour tracer des courbes de Bézier, qui m'a permis de créer des formes complexes en manipulant les points d'ancrage et les poignées de contrôle. J'ai également utilisé l'outil pour dessiner des lignes droites, ce qui m'a été utile pour réaliser des tracés précis. L'outil de dessin à main levée m'a offert une plus grande liberté créative en me permettant de dessiner des formes plus organiques et naturelles. ",
              "type": "text-short"
            },{
              "description": "L'une des fonctionnalités les plus amusantes et créatives d'Inkscape est la manipulation des nœuds des formes. J'ai pu déplacer, ajouter, supprimer ou modifier les nœuds pour ajuster la forme des objets, créer des effets de déformation ou des variations de contour.",
              "type": "text-short"
            },{
              "description": "Enfin, j'ai exploré la transformation des textes en chemins, ce qui signifie que je pouvais convertir les textes en objets éditables, composés de nœuds et de courbes. Cette fonctionnalité m'a permis une grande souplesse pour déformer les textes, les ajuster aux formes ou les incorporer dans des compositions.",
              "type": "text-short"
            }
          ]
        },{
          "titre": "Conclusion",
          "subSubChapters": [
            {
              "description": "En conclusion, Inkscape offre un ensemble d'outils puissants et polyvalents pour la création d'art numérique. En tant que logiciel de dessin vectoriel gratuit et open-source, il permet aux artistes de donner vie à leur imagination et de créer des œuvres originales et expressives.",
              "type": "text-short"
            },{
              "description": "L'un des principaux avantages d'Inkscape est sa nature vectorielle, qui garantit des images de haute qualité et redimensionnables sans perte de résolution. Les courbes de Bézier, les outils de dessin à main levée et la manipulation des nœuds offrent une flexibilité artistique permettant de créer des formes complexes, des illustrations détaillées et des effets personnalisés.",
              "type": "text-short"
            },{
              "description": "De plus, les fonctionnalités d'édition de texte permettent d'ajouter du contenu textuel et de le styliser de manière créative, en le manipulant comme des objets graphiques. Cette flexibilité ouvre la voie à des possibilités infinies pour la conception de logos, d'affiches, d'illustrations typographiques et bien plus encore.",
              "type": "text-short"
            },{
              "description": "Inkscape offre également des outils de coloration avancés, avec la possibilité de créer des dégradés, d'appliquer des motifs et d'expérimenter avec diverses techniques de remplissage. L'intégration de filtres et d'effets spéciaux permet d'ajouter des textures, des ombres, des reflets et des déformations pour donner une dimension supplémentaire aux créations artistiques.",
              "type": "text-short"
            },{
              "description": "En tant que logiciel libre, Inkscape bénéficie d'une communauté active qui partage des ressources et des tutoriels pour étendre ses fonctionnalités. Cela crée un environnement collaboratif propice à l'apprentissage et à l'exploration de nouvelles techniques artistiques.",
              "type": "text-short"
            },{
              "description": "Que ce soit pour la création d'illustrations, de graphiques, de logos, de bandes dessinées ou d'art typographique, Inkscape s'impose comme un outil incontournable dans le domaine de l'art numérique. Sa facilité d'utilisation, sa polyvalence et ses possibilités créatives en font un choix idéal pour les artistes souhaitant exprimer leur vision artistique de manière numérique.",
              "type": "text-short"
            }
          ]
        }
      ]
    },
    {
      "id": 5,
      "titre": "Site internet",
      "subChapters": [
        {
          "titre": "Pourquoi ce choix ?",
          "subSubChapters": [
            {
              "description":"J'ai choisi de rédiger mon rapport sous forme de site internet pour plusieurs raisons. Tout d'abord, le caractère interactif d'un site web permet de rappeler les différentes formes d'art numérique que j'ai présentées précédemment. En incorporant des éléments interactifs tels que des animations, des vidéos et des liens, j'ai pu créer une expérience immersive et dynamique pour les visiteurs, les invitant à explorer et à interagir avec mon travail.",
              "type": "text-short"
            },{
              "description":"De plus, les sites web sont souvent considérés comme des œuvres d'art en eux-mêmes. En utilisant les langages et les méthodes de programmation que j'ai appris dans le contexte de l'art numérique, le site web que j'ai créé témoigne de cet apprentissage. J'ai pu expérimenter avec des techniques de conception et de développement web pour donner vie à mes idées artistiques, tout en offrant une expérience esthétiquement plaisante et originale aux utilisateurs.",
              "type": "text-short"
            },{
              "description":"En résumé, la rédaction de mon rapport sous forme de site internet m'a permis de combiner l'interactivité, l'expression artistique et l'apprentissage des langages et des méthodes de programmation utilisédans l'art numérique. Cela a donné lieu à une expérience artistique immersive et dynamique, tout en offrant une accessibilité et une diffusion plus large de mon travail.",
              "type": "text-short"
            }
          ]
        },{
          "titre": "Présentation html",
          "subSubChapters": [
            {
              "URL": "assets/data/img/HTML5_logo.png",
              "type": "img"
            },
            {
              "description":"Le HTML est un langage de programmation utilisé pour structurer le contenu d'une page web. Il est considéré comme la base fondamentale de la création de sites internet et joue un rôle essentiel dans la présentation et l'organisation des informations sur une page web.",
              "type": "text-short"
            },{
              "description":"Le HTML utilise des balises pour marquer différents éléments du contenu, tels que les titres, les paragraphes, les images, les liens, les tableaux, les formulaires, etc. Chaque balise est entourée de chevrons (< >) et indique au navigateur web comment afficher ces éléments. Par exemple, la balise < h1 > marque un titre de premier niveau, tandis que la balise < p > est utilisée pour définir un paragraphe.",
              "type": "text-short"
            },{
              "description":"Une des particularités du HTML est sa structure hiérarchique. Les balises HTML sont imbriquées les unes dans les autres pour créer une structure en arborescence, où les balises parentes englobent les balises enfants. Cette hiérarchie permet de définir la relation entre les différents éléments de la page.",
              "type": "text-short"
            },{
              "description":"Le rôle principal du HTML dans la création d'un site internet est de définir la structure sémantique de la page. Il fournit une base solide pour le contenu en utilisant des balises appropriées pour chaque élément, ce qui facilite la compréhension du contenu par les moteurs de recherche et les lecteurs d'assistance. De plus, le HTML permet de créer des liens hypertexte entre les pages, ce qui permet à l'utilisateur de naviguer entre différentes parties du site.",
              "type": "text-short"
            }
          ]
        },{
          "titre": "Présentation css",
          "subSubChapters": [
            {
              "URL": "assets/data/img/CSS3_logo.png",
              "type": "img"
            },
            {
              "description":"Le CSS est un langage de programmation utilisé pour décrire la présentation et la mise en forme d'un document HTML. Il permet de contrôler l'apparence visuelle d'un site web, en définissant des règles pour la mise en page, les couleurs, les polices, les marges, les bordures, etc.",
              "type": "text-short"
            },{
              "description":"Le CSS fonctionne en associant des règles de style à des éléments HTML spécifiques. Ces règles sont définies à l'aide de sélecteurs CSS qui ciblent les balises HTML ou des classes et des identifiants spécifiques. Par exemple, on peut utiliser le sélecteur de balise \"p\" pour appliquer des styles à tous les paragraphes du document, ou utiliser une classe spécifique comme \".titre\" pour cibler uniquement les éléments avec cette classe.",
              "type": "text-short"
            },{
              "description":"Une des particularités du CSS est sa capacité à hiérarchiser les styles. Les règles CSS peuvent être définies à différents niveaux, du plus général au plus spécifique, et les styles seront appliqués en fonction de la cascade. Cela permet de modifier facilement l'apparence de plusieurs éléments en modifiant simplement une règle.",
              "type": "text-short"
            },{
              "description":"Le rôle principal du CSS est de séparer la présentation du contenu. En séparant le style du HTML, on obtient une meilleure maintenabilité et une plus grande flexibilité lors de la création d'un site web. ",
              "type": "text-short"
            }
          ]
        },{
          "titre": "Présentation angular",
          "subSubChapters": [
            {
              "URL": "assets/data/img/angular.png",
              "type": "img"
            },
            {
              "description":"Angular est un framework de développement d'applications web basé sur le TypeScript. Il est utilisé pour créer des sites web et des applications web interactives et évolutives. Angular fournit une structure et une méthodologie pour organiser, développer et déployer des projets web.",
              "type": "text-short"
            },{
              "description":"Une des caractéristiques principales d'Angular est la création de composants. Un composant est une unité autonome qui combine du code HTML, CSS et TypeScript pour définir un élément spécifique de l'interface utilisateur. ",
              "type": "text-short"
            },{
              "description":"Angular utilise également un système de liaison de données bidirectionnelle. Cela signifie que les modifications dans le modèle de données sont automatiquement reflétées dans l'interface utilisateur, et vice versa. Cette fonctionnalité permet de créer des applications réactives où les données et l'interface utilisateur sont constamment synchronisées.",
              "type": "text-short"
            },{
              "description":"Un autre aspect clé d'Angular est la gestion des routes. Angular propose un mécanisme de routage qui permet de créer des applications à pages multiples et de naviguer entre ces pages de manière fluide. Cela facilite la création d'applications web avec une expérience utilisateur fluide et intuitive.",
              "type": "text-short"
            },{
              "description":"En résumé, Angular est un framework de développement d'applications web qui facilite la création de sites web et d'applications web interactives. Il permet de structurer le code en utilisant des composants, de gérer la liaison de données bidirectionnelle et de gérer les routes pour créer des applications web réactives et à pages multiples.",
              "type": "text-short"
            }
          ]
        },{
          "titre": "Présentation du site et de ses fonctionnalités",
          "subSubChapters": [
            {
              "description":"Pour commencer, j’ai créé différents « components », pour mettre en forme le contenu de mon rapport : ",
              "type": "text-short"
            },{
              "description":"-\tHeader : ce component contient l’en-tête donc la bannière du rapport.<br>-\tFooter : celui-ci contient le pied de page, comme son nom l’indique.<br>-\tNavbar : contient la bar de navigation qui permet de passer d’un chapitre à un autre.<br>-\tChapter : ce component gère l’affichage de l’ensemble des paragraphes des chapitres ainsi que de leurs titres en utilisant text-component<br>-\tText-components : fait appel à plusieurs autres components pour gérer la mise en forme des différents paragraphes du rapport.<br>o\tImg : est utilisé lorqu’une image doit être affichée avec un texte en dessous.<br>o\tText-img-r : est utilisé lorsqu’il faut positionner une image à droite d’un texte.<br>o\tText-short : est le composant de base que j’utilise pour les paragraphes strandards.<br>o\tSketch : ce component affiche les animations de P5.js à partir du lien du sketch.<br>-\tTitle-page : est le component principal qui va rassembler tous les autres et donc former le site.<br>",
              "type": "text-short"
            },{
              "description":"L’intégralité du contenu du rapport est stockée dans un fichier json, en respectant une structure particulière que j’ai défini dans les fichiers Chapter.model.ts, SubChapter.model.ts et SubSubChapter.model.ts.<br>Un chapitre est constitué d’un id qui est un entier, un titre et d’un tableau de sous-chapitres. Les sous-chapitres, sont constitués d’un titre et d’un tableau de sous-sous chapitres (des paragraphes), qui eux, contiennent un URL, une description et un type. L’affichage du paragraphe sera conditionné en fonction de son type (img, text-img-r, short-text ou sketch)<br>Par exemple, si le paragraphe n’est pas illustré par une photo, le type utilisé sera short-text. Si je souhaite qu’une photo soit affiché à droite du texte, j’utiliserai text-img-r…<br>",
              "type": "text-short"
            },{
              "description":"J’ai également créé un service pour gérer le changement de chapitres. Un service est un ensemble de fonctionnalités regroupées dans un bloc de code réutilisable. Il permet de séparer les fonctionnalités spécifiques d'une application du reste du code, ce qui favorise la modularité et la réutilisabilité. En utilisant un service, on peut interagir de manière abstraite avec d'autres parties de l'application, facilitant ainsi le développement et la maintenance du code.",
              "type": "text-short"
            },{
              "description":"Le « chapter service » permet de récupérer des chapitres à partir d'un fichier JSON en utilisant le module HttpClient d'Angular. Il expose deux méthodes principales : getChapters() pour obtenir tous les chapitres et getChapter(id) pour récupérer un chapitre spécifique en fonction de son identifiant. Les données sont chargées à partir du fichier JSON et retournées sous forme d'observables, ce qui permet de les manipuler de manière réactive dans d'autres parties du site.",
              "type": "text-short"
            },{
              "description":"",
              "type": "text-short"
            }
          ]
        },{
          "titre": "Principales difficultés rencontrées",
          "subSubChapters": [
            {
              "description":"La création de mon site internet a été un véritable défi, car je suis partie de zéro. Je n'avais aucune connaissance préalable en CSS, HTML ou même en Angular, le framework que j'ai choisi d'utiliser. Pour acquérir les compétences nécessaires, j'ai suivi des cours en ligne sur OpenClassrooms qui portaient sur le CSS, l'HTML et Angular. Chaque langage semblait relativement accessible individuellement, mais lorsque j'ai dû les combiner, les choses ont commencé à se compliquer. ",
              "type": "text-short"
            },{
              "description":"Pour rendre mon code plus modulable et organisé, j'ai utilisé des composants (components) dans Angular. Un composant est une unité autonome qui combine du code HTML, CSS et TypeScript pour définir un élément spécifique de l'interface utilisateur. Au début, cela a ajouté une autre couche de confusion, car je ne savais pas quelles fonctions devaient être placées dans quel composant et dans quel fichier du composant. ",
              "type": "text-short"
            },{
              "description":"Face à cette confusion, j'ai décidé de revoir les cours et de regarder des vidéos pour mieux comprendre le rôle de chaque fichier. Les deux jours que j'avais consacrés à l'apprentissage étaient insuffisants pour assimiler toutes les fonctionnalités et propriétés de chaque langage, ainsi que pour comprendre comment les assembler de manière efficace. ",
              "type": "text-short"
            },{
              "description":"Malgré ces difficultés, j'ai persévéré et, au fur et à mesure de mon apprentissage, j'ai commencé à voir la logique et la structure du code émerger. J'ai pu créer des composants qui fonctionnaient ensemble pour donner vie à mon site web. ",
              "type": "text-short"
            },{
              "description":"J’ai tout de même rencontré plusieurs autres difficultés, en voici quelques-unes : ",
              "type": "text-short"
            },{
              "description":"Lorsque j'ai essayé de passer un lien de P5.js à l’attribut URL dans le fichier json, le sketch ne s’affichait pas dans le site, mais il n’y avait aucune erreur de signalé où que ce soit. Ce n’est qu’après de multiples recherches que je suis tombée sur une vidéo qui expliquait que Angular bloquait les scripts qui étaient chargé de d’autres domaines pour des raisons de sécurités.<br>J'ai dû mettre en place une fonction pour \"sécuriser\" les liens, de manière à ce qu'Angular les accepte et puisse les afficher.<br>",
              "type": "text-short"
            },{
              "description":"Après avoir inséré le contenu du rapport dans le fichier JSON, j'ai constaté que les sauts de ligne n'étaient pas pris en compte lors de l'affichage du texte. Le contenu du rapport apparaissait comme un seul paragraphe continu, ce qui rendait sa lecture difficile.<br>En utilisant la liaison de propriété `innerHTML` avec Angular, j’ai pu résoudre le problème. En assignant la valeur de `subSubChapter.description` à la propriété `innerHTML`, Angular interprète le contenu comme du code HTML et prend en compte les balises de saut de ligne telles que `<br>` ou les balises de paragraphe `<p>`. Cela permet d'afficher le texte avec les sauts de ligne correctement interprétés, rendant ainsi la lecture du rapport plus claire.<br>",
              "type": "text-short"
            },{
              "description":"",
              "type": "text-short"
            }
          ]
        }
      ]
    },
    {
      "id": 6,
      "titre": "Conclusion",
      "subChapters": [
        {
          "titre": "Connaissances acquises",
          "subSubChapters": [
            {
              "description": "Cette expérience m'a non seulement permis de développer mes compétences en programmation, mais aussi de comprendre l'importance de la planification et de l'organisation dans un projet de création numérique.",
              "type": "text-short"
            },{
              "description": "Au cours de ce projet, j'ai acquis de nombreuses connaissances en explorant l'art numérique dans ses différentes formes. J'ai pu découvrir les aspects variés de ce mouvement, allant de l'art vectoriel à l'art interactif, en passant par l'art génératif, le crypto art et bien d'autres encore. Cette immersion dans l'art numérique m'a permis de mieux comprendre les concepts et les techniques utilisés pour créer des œuvres numériques uniques et innovantes.",
              "type": "text-short"
            },{
              "description": "Une partie importante de mon apprentissage a été axée sur l'utilisation de P5.js, une bibliothèque JavaScript dédiée à la création d'art numérique. Grâce à P5.js, j'ai pu explorer les possibilités de la programmation et du code en créant des petits projets visuels interactifs. Cela m'a ouvert les portes du monde de la programmation et du développement web, en me familiarisant avec les concepts clés du JavaScript.",
              "type": "text-short"
            },{
              "description": "J'ai également approfondi mes connaissances en utilisant des outils tels qu'Inkscape, qui m'ont permis de créer des éléments graphiques vectoriels pour mes projets. J'ai appris à manipuler les formes, les couleurs et les effets pour créer des compositions visuelles attrayantes.",
              "type": "text-short"
            },{
              "description": "En plus des langages de programmation et des outils spécifiques, j'ai appris l'importance du HTML, du CSS et d'Angular dans la création d'un site web artistique. J'ai compris le rôle de chaque fichier, que ce soit le HTML pour la structure, le CSS pour la mise en page et le style, ou encore Angular pour la gestion des composants, des services et des modèles. ",
              "type": "text-short"
            },{
              "description": "Dans l'ensemble, les connaissances acquises au cours de ce projet ont été précieuses et m'ont ouvert de nouvelles perspectives sur l'art numérique et la création artistique à travers le code et la technologie.",
              "type": "text-short"
            }
          ]

        },{
          "titre": "Réflexivité",
          "subSubChapters": [
            {
              "description": "C’est souvent une fois le travail bien entamé qu’on se rend compte qu’on ne s’y est pas pris correctement.",
              "type": "text-short"
            },{
              "description": "Tout d'abord, j'aurais dû consacrer plus de temps aux cours sur les différents langages que j’ai utilisé et je me serais penché sur les différents exemples proposés dans ces cours. Au lieu de vouloir immédiatement appliquer mes connaissances à mon projet, j'aurais pris le temps de comprendre pleinement les concepts et les fonctionnalités d'Angular, ainsi que le rôle des différents fichiers et composants. ",
              "type": "text-short"
            },{
              "description": "En prenant le temps d'achever les cours avant de commencer le projet, j'aurais pu mieux organiser ma démarche. J'aurais identifié les différents composants nécessaires pour mon site web, établi une structure claire et défini une planification plus précise. Cela m'aurait permis de travailler de manière plus méthodique et d'éviter certaines difficultés rencontrées lors de l'assemblage des différentes parties de mon projet.",
              "type": "text-short"
            },{
              "description": "En outre, j'aurais accordé une attention particulière à la documentation et aux ressources disponibles. J'aurais exploré davantage les guides et les tutoriels pour approfondir ma compréhension des langages de programmation et des outils utilisés. Cela aurait renforcé ma confiance dans la réalisation du projet et m'aurait aidé à résoudre plus facilement les problèmes techniques rencontrés en cours de route.",
              "type": "text-short"
            },{
              "description": "En résumé, si je devais recommencer ce projet, j'investirais plus de temps dans l'apprentissage préalable et la compréhension approfondie des concepts. J'organiserais mon projet de manière plus méthodique et j'exploiterais davantage les ressources disponibles pour faciliter mon apprentissage. Cela me permettrait d'aborder le projet avec une meilleure maîtrise des outils et des techniques, et d'obtenir un résultat plus fluide et abouti.",
              "type": "text-short"
            }
          ]

        },{
          "titre": "Synthèse",
          "subSubChapters": [
            {
              "description": "",
              "type": "text-short"
            },{
              "description": "Cette expérience m'a apporté une compréhension plus approfondie de l'intersection entre l'art et la technologie. J'ai réalisé que le code informatique peut être utilisé comme un outil puissant pour générer des formes artistiques, des animations et des interactions innovantes. Le mariage de la créativité artistique et des langages de programmation offre des possibilités infinies pour repousser les limites de l'expression artistique.",
              "type": "text-short"
            },{
              "description": "Cependant, tout au long de ce projet, j'ai également fait face à des défis importants. L'apprentissage de plusieurs langages de programmation simultanément, ainsi que la compréhension des concepts complexes d'Angular et la gestion des différents fichiers et composants, ont été des tâches ardues. J'ai dû consacrer du temps à la recherche, à la consultation de la documentation et à l'expérimentation pour surmonter ces difficultés.",
              "type": "text-short"
            },{
              "description": "En ce qui concerne la problématique posée, \"le code est-il l'avenir de l'art ?\", ma réponse serait que le code a un rôle de plus en plus important dans l'art contemporain. Il offre aux artistes de nouvelles possibilités pour créer des œuvres interactives, génératives et basées sur des algorithmes. Le code permet de repousser les frontières de la créativité et de créer des expériences artistiques uniques. Cependant, cela ne signifie pas que le code remplace complètement les autres formes d'art traditionnelles. Les deux peuvent coexister et se compléter, offrant ainsi une diversité d'expressions artistiques.",
              "type": "text-short"
            },{
              "description": "",
              "type": "text-short"
            }
          ]

        }
      ]
    }
  ]

